app/controllers/comments_controller.rb

	def create
		@post = Post.find (params[:post_id])
		@comment=@post.comments.create!(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?)  [["body", "ok"], ["created_at", Sun, 27 Oct 2013 21:53:39 UTC +00:00], ["post_id", 3], ["updated_at", Sun, 27 Oct 2013 21:53:39 UTC +00:00]]