app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "test\r\n"], ["created_at", Sun, 27 Oct 2013 20:03:09 UTC +00:00], ["title", "test"], ["updated_at", Sun, 27 Oct 2013 20:03:09 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "title" = 'coucou', "body" = 'Aujourd''hui on a eu un beau soleil :)', "updated_at" = '2013-10-27 20:25:11.260015' WHERE "posts"."id" = 2